# SystemtypeRisedrop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..SystemtypeRisedrop Property
GroupTypeId Class See Also
---
Rise / Drop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId SystemtypeRisedrop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SystemtypeRisedrop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SystemtypeRisedrop {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace